tests/cassettes/webservice.test_rms.TestRMS.test_rms_order.yaml

interactions:
- request:
    body: "<?xml version='1.0' encoding='utf-8'?>\n<soap-env:Envelope xmlns:soap-env=\"\
      http://schemas.xmlsoap.org/soap/envelope/\">\n  <soap-env:Body>\n    <ns0:getRequestId\
      \ xmlns:ns0=\"http://orderapi.rms.rakuten.co.jp/rms/mall/order/api/ws\">\n \
      \     <arg0>\n        <authKey>XXXXXX</authKey>\n        <shopUrl></shopUrl>\n\
      \        <userName></userName>\n      </arg0>\n    </ns0:getRequestId>\n  </soap-env:Body>\n\
      </soap-env:Envelope>\n"
    headers:
      Accept: ['*/*']
      Accept-Encoding: ['gzip, deflate']
      Connection: [keep-alive]
      Content-Length: ['444']
      Content-Type: [text/xml; charset=utf-8]
      SOAPAction: ['""']
      User-Agent: [python-requests/2.12.0]
    method: POST
    uri: https://api.rms.rakuten.co.jp/es/1.0/order/ws
  response:
    body:
      string: !!binary |
        H4sIAAAAAAAAA3VQPU8DMQz9K6g78dExChlAHVh7vyDqWVfgEgc7x8dYOjMiRhaEEEwsTBV/JgL1
        ZxAKRyck68l6tt/Ts6n1JJxjRxF3Ln0XRNf7o3lKUQPIbI7eiSq8kIuKuIXvBvD3AkbW1PqAmitr
        gox1i2mKZz1KOmqmKJGCDKpl/KdL3CC7eKzYi2J32icMakbqJEJhwLuu+9mBsgQXUlwYU8/BGmQm
        PqQG7aQa71bVnoEtZTyKuBZtXj7m5SpfvxVcP9+sn1Z58fLx8Pp5e5cXpd43eG9gODAwGMB/Ocpo
        iArbn9kvnMMqTUABAAA=
    headers:
      Connection: [close]
      Content-Encoding: [gzip]
      Content-Length: ['242']
      Content-Type: [text/xml;charset=UTF-8]
      Date: ['Thu, 01 Dec 2016 16:51:22 GMT']
      Server: [nginx]
      Vary: [Accept-Encoding]
      requestId: [d38edac0-6b74-47a0-b5bb-0ee2018d1040]
      timeStamp: ['2016-12-01T16:51:22']
    status: {code: 200, message: OK}
version: 1
